БИТУправление_медицинским_центром_демо/src/DataProcessors/УниверсальныйПоискКлиентов/УниверсальныйПоискКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УниверсальныйПоискКлиентов</name>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыСобытий/ВидыСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытий</name>
  <enumValues>
    <name>ВходящееПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ВходящийЗвонок</name>
  </enumValues>
  <enumValues>
    <name>ИсходящийЗвонок</name>
  </enumValues>
  <enumValues>
    <name>ЛичнаяВстреча</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/Событие/Событие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Событие</name>
  <basedOn>Document.Заявка</basedOn>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ЛистОжидания</basedOn>
  <basedOn>Task.ЗадачиПользователя</basedOn>
  <basedOn>Document.ОбратнаяСвязь</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеСобытия</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗвонка</name>
    <type>
      <types>CatalogRef.ТипыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходЗвонка</name>
    <type>
      <types>CatalogRef.ИсходыЗвонка</types>
    </type>
  </attributes>
  <attributes>
    <name>УспешностьЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЗвонка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьРазговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВидЗвонка</name>
    <type>
      <types>EnumRef.фонВидыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>бит_НабранныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРекламы</name>
    <comment>UTM_MEDIUM</comment>
    <type>
      <types>CatalogRef.ТипыРекламы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <comment>UTM_SOURCE</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РекламнаяКомпания</name>
    <comment>UTM_CAMPAIGN</comment>
    <type>
      <types>CatalogRef.РекламныеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоРекламнойКомпании</name>
    <comment>UTM_TERM</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбъявления</name>
    <comment>UTM_CONTENT</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/DataProcessors/УниверсальныйПоискКлиентов/Forms/СозданиеСобытий/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Филиал = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
	ДатаПлан = ТекущаяДата() + 86400;
	Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	СписокКлиентов = Параметры.СписокКлиентов;
	СписокКлиентов.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапланироватьЗвонки(Команда)
	
	ДанныеФормы = Новый Структура("ДатаПлан, Исполнитель, Филиал, СписокКлиентов, ТипЗвонка, Цель");
	ЗаполнитьЗначенияСвойств(ДанныеФормы, ЭтаФорма);
	СозданоОбъектов = ЗапланироватьЗвонкиНаСервере(ДанныеФормы);
	ОповещениеПродолжения = Новый ОписаниеОповещения("ЗапланироватьЗвонкиЗавершение", ЭтаФорма);
	ТекстПредупреждения = СтрШаблон(НСтр("ru= 'Запланировано звонков: %1'"), Строка(СозданоОбъектов));
	ПоказатьПредупреждение(ОповещениеПродолжения, ТекстПредупреждения, 10, "Оповещение");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапланироватьЗвонкиЗавершение(ДопПараметры) Экспорт
	
	Закрыть();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапланироватьЗвонкиНаСервере(ДанныеФормы)
	
	СчСозданных = 0;
	Для Каждого элКлиент Из ДанныеФормы.СписокКлиентов Цикл 
		
		Если Не элКлиент.Пометка Тогда 
			Продолжить;
		КонецЕсли;
		
		СобытиеОбъект = Документы.Событие.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(СобытиеОбъект, ДанныеФормы);
		СобытиеОбъект.Дата = ТекущаяДата();
		СобытиеОбъект.ВидСобытия = Перечисления.ВидыСобытий.ИсходящийЗвонок;
		СобытиеОбъект.Клиент = элКлиент.Значение;
		СобытиеОбъект.ПлановыйИсполнитель = ДанныеФормы.Исполнитель;
		СобытиеОбъект[ПроцедурыСпециализацииПоставки.ИмяРеквизитаФилиалДокументов()] = ДанныеФормы.Филиал;
		СобытиеОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		СобытиеОбъект.Записать();
		СчСозданных = СчСозданных + 1;
		
	КонецЦикла;
	
	Возврат СчСозданных;
	
КонецФункции

#КонецОбласти
